<template>
  <ve-line :data="chartData"></ve-line>
  <!-- :mark-line="markLine" -->
</template>

<script>
// export default {
//   name: 'HelloWorld',
//   props: {
//     msg: String
//   },
// }
export default {
  name: "echarts",
  data() {
    //标线
    // this.markLine = {
    //   data: [
    //     {
    //       name: "母线电压警戒线",
    //       yAxis: 220
    //     },
    //     {
    //       name: "正极电压警戒线",
    //       yAxis: 20
    //     }
    //   ]
    // };
    return {
      chartData: {
        columns: [
          "日期",
          "母线电压",
          "正极电压",
          "负极电压",
          "交流电压",
          "纹波电压",
          "正极绝缘",
          "负极绝缘",
          "母联绝缘"
        ],
        rows: [
          //   { 日期: "04-2", 母线电压: 217, 正极电压: 21 },
          //   { 日期: "04-3", 母线电压: 230, 正极电压: 20 },
          //   { 日期: "04-4", 母线电压: 220, 正极电压: 21 },
          //   { 日期: "04-5", 母线电压: 180, 正极电压: 19 },
          //   { 日期: "05-0", 母线电压: 219, 正极电压: 19 },
          //   { 日期: "05-1", 母线电压: 218, 正极电压: 20 }
          {
            日期: "10-15",
            母线电压: "217",
            正极电压: "20",
            负极电压: "-24",
            交流电压: "220",
            纹波电压: "10",
            正极绝缘: "50",
            负极绝缘: "3",
            母联绝缘: "36"
          },
          {
            日期: "10-16",
            母线电压: "230",
            正极电压: "21",
            负极电压: "-22",
            交流电压: "221",
            纹波电压: "8",
            正极绝缘: "48",
            负极绝缘: "1",
            母联绝缘: "40"
          },
          {
            日期: "10-17",
            母线电压: "220",
            正极电压: "17",
            负极电压: "-23",
            交流电压: "218",
            纹波电压: "11",
            正极绝缘: "53",
            负极绝缘: "2",
            母联绝缘: "32"
          },{
            日期: "10-18",
            母线电压: "217",
            正极电压: "20",
            负极电压: "-24",
            交流电压: "220",
            纹波电压: "10",
            正极绝缘: "50",
            负极绝缘: "3",
            母联绝缘: "36"
          },
          {
            日期: "10-19",
            母线电压: "230",
            正极电压: "21",
            负极电压: "-22",
            交流电压: "221",
            纹波电压: "8",
            正极绝缘: "48",
            负极绝缘: "1",
            母联绝缘: "40"
          },
          {
            日期: "10-20",
            母线电压: "220",
            正极电压: "17",
            负极电压: "-23",
            交流电压: "218",
            纹波电压: "11",
            正极绝缘: "53",
            负极绝缘: "2",
            母联绝缘: "32"
          },{
            日期: "10-21",
            母线电压: "217",
            正极电压: "20",
            负极电压: "-24",
            交流电压: "220",
            纹波电压: "10",
            正极绝缘: "50",
            负极绝缘: "3",
            母联绝缘: "36"
          },
          {
            日期: "10-22",
            母线电压: "230",
            正极电压: "21",
            负极电压: "-22",
            交流电压: "221",
            纹波电压: "8",
            正极绝缘: "48",
            负极绝缘: "1",
            母联绝缘: "40"
          },
          {
            日期: "10-23",
            母线电压: "220",
            正极电压: "17",
            负极电压: "-23",
            交流电压: "218",
            纹波电压: "11",
            正极绝缘: "53",
            负极绝缘: "2",
            母联绝缘: "32"
          },
        ]
      }
    };
  }
};
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
</style>
